<!-- dflook/terraform-github-actions {"workspace":"partial_backend_config","backend":"7a8504e900c0f37b370ea3010b62b7e31c000a758e7c5a86edf3cfd65ea3b4b6","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #294 at https://github.com/dflook/terraform-github-actions/actions/runs/3564607163","plan_hash":"234bdba6bf00355da97c228f609724e1fd9064d5230c4b0c8d8ca49cba5bc25f","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __partial_backend_config__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "BlH2OVe45E" -> (known after apply)
  ~ foreach = "kXHopzEp9y" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #294](https://github.com/dflook/terraform-github-actions/actions/runs/3564607163)